controltheory/beamer/4/4_2_law.org
# +LaTeX_CLASS:  article
#+LATEX_HEADER: \usepackage{etex}
#+LATEX_HEADER: \usepackage{amsmath}
 # +LATEX_HEADER: \usepackage[usenames]{color}
#+LATEX_HEADER: \usepackage{pstricks}
#+LATEX_HEADER: \usepackage{pgfplots}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage[europeanresistors,americaninductors]{circuitikz}
#+LATEX_HEADER: \usepackage{colortbl}
#+LATEX_HEADER: \usepackage{yfonts}
#+LATEX_HEADER: \usetikzlibrary{shapes,arrows}
#+LATEX_HEADER: \usetikzlibrary{positioning}
#+LATEX_HEADER: \usetikzlibrary{arrows,shapes}
#+LATEX_HEADER: \usetikzlibrary{intersections}
#+LATEX_HEADER: \usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
#+LATEX_HEADER: \usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
#+LATEX_HEADER: \setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
#+LATEX_HEADER: \setCJKmonofont{Evermore Kai}
 # +LATEX_HEADER: \xeCJKsetup{CJKglue=\hspace{0pt plus .08 \baselineskip }}
#+LATEX_HEADER: \usepackage{pst-node}
#+LATEX_HEADER: \usepackage{pst-plot}
#+LATEX_HEADER: \psset{unit=5mm}


#+startup: beamer
#+LaTeX_CLASS: beamer
# +LaTeX_CLASS_OPTIONS: [table]
# +LaTeX_CLASS_OPTIONS: [bigger]
 # +latex_header:  \usepackage{beamerarticle}
# +latex_header: \mode<beamer>{\usetheme{JuanLesPins}}
# +latex_header: \mode<beamer>{\usetheme{Boadilla}}
#+latex_header: \mode<beamer>{\usetheme{Frankfurt}}
#+latex_header: \mode<beamer>{\usecolortheme{dove}}
#+latex_header: \mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
#+latex_header: \mode<beamer>{\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}}
#+latex_header: \setbeamercovered{transparent}
#+BEAMER_FRAME_LEVEL: 2
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

#+TITLE:  线性系统的根轨迹法
#+latex_header: \subtitle{根轨迹绘制法则}
#+AUTHOR:    
#+EMAIL: 
#+DATE:  
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:










* 根轨迹图绘制法则
** 根轨迹图的绘制
 * 前提条件: 
     * <2->变动参数为开环传递函数的根轨迹增益  $K_g,(K^*)$ 
     * <3->系统为负反馈系统
 * 目的:
     * 根据开环零极点分布绘制闭环极点的运动轨迹

** 根轨迹的起点,终点及分支数
 * <2->根轨迹起源于开环极点,
 * <3->根轨迹终止于开环零点,
 * <4->有  $\max(m,n)$  条分支,
 * <5->有 $n-m$ 条分支趋向无穷远处.
** 根轨迹的对称性
 * <2->根轨迹对称于实轴
** 实轴上的根轨迹
 * <2->实轴上某区域若其右边开环实数零极点个数之和为奇数,则该区域为根轨迹区域
 * <2->例:  
    \[G_o(s)=\frac{K_g(s+1)(s+3)}{s(s+2)}\]
     * <3-> 实轴上根轨迹区域:  
            \[ [0,-1],[-2,-3] \]
** 渐近线
 * <2-> $n>m$ 时,渐近线与实轴交点为  $\sigma_a$  ,夹角为  $\phi$  则:
       \begin{eqnarray*}
       \sigma_a & = &\frac{\sum_{i=1}^n p_i -\sum_{j=1}^m z_j}{n-m} \\
       \phi &=& \frac{(2k+1)\pi}{n-m}
       \end{eqnarray*}

** 分离点与分离角
 * <2->分离点: 两条或两条以上根轨迹分支在  $s$  平面上相交又立刻分开的点称为根轨迹的分离点(会合点)
 * <3->分离角: 相邻两条根轨迹分支的夹角

*** 分离点计算:						      :B_block:BMCOL:
     :PROPERTIES:
     :BEAMER_env: block
     :BEAMER_envargs: <4->
     :BEAMER_col: 0.5
     :END:
\begin{eqnarray*}
G(s) & = & \frac{K_g M(s)}{N(s)}\\
D(s) &=& N(s)+K_g M(s) \\
D(s) &=& 0 \\
N(s) &=& - K_g M(s) \\
D'(s) &=& 0 \\
N'(s) &=& -K_g M'(s) \\
M'(s)N(s) &=&M(s)N'(s) \\
\sum_{i=1}^n\frac{1}{d-p_i} &=& \sum_{j=1}^m\frac{1}{d-z_j}
\end{eqnarray*}

*** 分离角计算:						      :B_block:BMCOL:
     :PROPERTIES:
     :BEAMER_env: block
     :BEAMER_envargs: <5->
     :BEAMER_col: 0.5
     :END:

$\theta_d = \frac{(2k+1)\pi}{l}, k=0,1,\cdots,l-1$ , 其中  $l$  为分离点处根轨迹的分支数

** 根轨迹的起始角与终止角
 * 起始角( $\theta_{p_i}$ ): 根轨迹从开环极点出发时,其切线与正实轴的夹角(出射角)
 * 终止角( $\phi_{z_j}$ ): 根轨迹终止于开环零点时,其切线与正实轴的夹角(入射角)
** 起始角
\begin{eqnarray*}
\sum_{l=1}^{m}\angle(s-z_{l})-\sum_{i=1}^{n}\angle(s-p_{i}) & = & (2k+1)\pi\\
s & = & p_{q}+\delta re^{j\theta}\\
\sum_{l=1}^{m}\angle(p_{q}+\delta re^{j\theta}-z_{l})-\sum_{i=1}^{n}\angle(p_{q}+\delta re^{j\theta}-p_{i}) & = & (2k+1)\pi\\
\lim_{\delta r\rightarrow0}\sum_{l=1}^{m}\angle(p_{q}+\delta re^{j\theta}-z_{l})-\sum_{i=1}^{n}\angle(p_{q}+\delta re^{j\theta}-p_{i}) & = & (2k+1)\pi\\
\sum_{l=1}^{m}\angle(p_{q}-z_{l})-\sum_{p_{q}=p_{i}}\theta-\sum_{p_{q}\not=p_{i}}\angle(z_{q}-p_{i}) & = & (2k+1)\pi
\end{eqnarray*}


** 终止角
\begin{eqnarray*}
\sum_{l=1}^{m}\angle(s-z_{l})-\sum_{i=1}^{n}\angle(s-p_{i}) & = & (2k+1)\pi\\
s & = & z_{q}+\delta re^{j\theta}\\
\sum_{l=1}^{m}\angle(z_{q}+\delta re^{j\theta}-z_{l})-\sum_{i=1}^{n}\angle(z_{q}+\delta re^{j\theta}-p_{i}) & = & (2k+1)\pi\\
\lim_{\delta r\rightarrow0}\sum_{l=1}^{m}\angle(z_{q}+\delta re^{j\theta}-z_{l})-\sum_{i=1}^{n}\angle(z_{q}+\delta re^{j\theta}-p_{i}) & = & (2k+1)\pi\\
\sum_{z_{q}\not=z_{l}}\angle(z_{q}-z_{l})+\sum_{z_{q}=z_{l}}\theta-\sum_{i=1}^{n}\angle(z_{q}-p_{i}) & = & (2k+1)\pi
\end{eqnarray*}


** 根轨迹的起始角与终止角计算公式:
   
\begin{eqnarray*}
\theta_{p_i} & = & \frac{(2k+1)\pi}{I}+\frac{1}{I}\left[\sum_{j=1}^m\angle(p_i-z_j)-\sum_{\substack{j=1 \\ p_j\neq p_i}}^n\angle(p_i-p_j)\right] \\
\phi_{z_j} & = & \frac{(2k+1)\pi}{J}-\frac{1}{J}\left[\sum_{\substack{i=1 \\ z_i\neq z_j}}^m\angle(z_j-z_i)-\sum_{i=1}^n\angle(z_j-p_i)\right] 
\end{eqnarray*}
 * $I$ 极点重根个数
 * $J$ 零点重根个数

** 根轨迹的起始角与终止角计算公式(无重根时):
   
\begin{eqnarray*}
\theta_{p_i} & = & 180^{\circ}+\left[\sum_{j=1}^m\angle(p_i-z_j)-\sum_{\substack{j=1 \\ j\neq i}}^n\angle(p_i-p_j)\right] \\
\phi_{z_j} & = & 180^{\circ}-\left[\sum_{\substack{i=1 \\ i\neq j}}^m\angle(z_j-z_i)-\sum_{i=1}^n\angle(z_j-p_i)\right] 
\end{eqnarray*}

即:
 * $\theta_{p_i}$  等于:  $180^{\circ}$  +(所有零点指向极点 $p_i$ 的角度之和 -所有其它极点指向极点 $p_i$ 的角度之和)
 * $\phi_{z_i}$ 等于: $180^{\circ}$ -(所有其它零点指向零点 $z_j$ 的角度之和 -所有极点指向零点 $z_j$ 的角度之和)

** 根轨迹与虚轴交点
*** 直接计算						      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_envargs: <2->
     :BEAMER_env: block
     :END:
将 $s=j\omega$ 代入$D(s)$ ,求出 $K_g,\omega$ , $(0,j\omega)$ 即为交点

\begin{eqnarray*}
D(s) &= &K_gM(s)+N(s) \\
 &=& 0 \\
s &=& j\omega \\
D(j\omega) &=& 0 \\
\Re[D(j\omega)] &=& 0\\
\Im[D(j\omega)] &=& 0
\end{eqnarray*}

*** 利用Routh判据计算					      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_envargs: <3->
     :BEAMER_env: block
     :END:

例:
\begin{gather*}
G_o(s)  =  \frac{K_g}{s(s+1)(s+2)} \\
D(s)  = s^3+3s^2+2s+K_g \\
\begin{matrix}
s^3  &  1 &  2 \\
s^2  &  3  &  K_g \\
s^1  & \frac{6-K_g}{3} \\
s^0  & K_g
\end{matrix}
\end{gather*}

令 $\frac{6-K_g}{3}=0$ 得 $K_g=6$, 解辅助方程: $3s^2+K_g=0$ 得 $s=\pm j\sqrt{2}$
** 根之和
 * <2-> $n-m\geq 2$ 时, 闭环极点之和等于开环极点之和

* 示例
** 根轨迹示例1 $G_o(s) = \frac{K_g(s+1)}{s(s+4)(s^2+2s+2)}$

解:
  * <2->开环零点: $-1$ , 开环极点: $0,-4,-1\pm j$
  * <3->实轴上根轨迹:  $[-1,0],[-\infty,-4]$
  * <4->渐近线: 
       * $\sigma_a=\frac{\sum p_i-\sum z_j}{n-m}=\frac{-6+1}{3}=-\frac{5}{3}$
       * $\phi=\pm\frac{\pi}{3}$
  * <5->起始角: 
       * $\theta_{p_1}=180^{\circ}+(90^{\circ}-135^{\circ}-90^{\circ}-\arctan\frac{1}{3})=27^{\circ}$
       * $\theta_{p_2}=-27^{\circ}$
** 根轨迹示例1(续)
 与虚轴交点  $D(s)=s^4+6s^3+10s^2+(8+K_g)s+K_g =0$ 

*** Routh表如下							    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
       \[\begin{matrix}
       s^4 & 1 & 10 & K_g \\
       s^3 & 6 & 8+K_g \\
       s^2 & \frac{52-K_g}{6} & K_g \\
       s^1 & 8+K_g-\frac{36K_g}{52-K_g} \\
       s^0 & K_g
       \end{matrix}\]

** 根轨迹示例1(续)
*** 计算交点处 $K_g$					      :BMCOL:B_block:
    :PROPERTIES:
    :BEAMER_col: 0.5
    :BEAMER_env: block
    :END:
   
       \begin{eqnarray*}
       8+K_g-\frac{36K_g}{52-K_g} &=& 0\\
       K_g^2-8K_g-416 &=& 0 \\
       K_g &=& 4\pm 4\sqrt{27} \\
       \end{eqnarray*}

***  取 $K_g=4+4\sqrt{27}$ 代入辅助方程:		      :BMCOL:B_block:
    :PROPERTIES:
    :BEAMER_col: 0.5
    :BEAMER_envargs: <2->
    :BEAMER_env: block
    :END:
       
       \begin{eqnarray*}
       \frac{52-K_g}{6}s^2+K_g & = &0 \\
       s_{1,2} &=& \pm j2.3
       \end{eqnarray*}

** 根轨迹示例1(续)根轨迹图
\begin{tikzpicture}
\coordinate (o) at (0,0);
\coordinate (ox) at (0.5,0);
\draw[->] (-5,0) -- (ox);
\draw[->] (0,-3) -- (0,3);
\draw (o) node[below left] {$o$};
\draw[thick,red] (-4,0) node {$\times$};
\draw[thick,red] (0,0) node {$\times$};
\draw[thick,red] (-1,1) node {$\times$};
\draw[thick,red] (-1,-1) node {$\times$};
\draw[thick,blue] (-1,0) node {$o$};
\draw [red,thick,smooth] plot coordinates {(-1,-1) (-0.5,-1.3) (0,-2.3) (0.5,-3.5)};
\draw [red,thick,smooth] plot coordinates {(-1,1) (-0.5,1.3) (0,2.3) (0.5,3.5)};
\draw [->,red,thick] (-4,0)--(-5,0);
\draw [->,red,thick] (0,0)--(-1,0);
\draw [violet,dashed] (-5/3,0)--+(60:3.7);
\draw [violet,dashed] (-5/3,0)--+(-60:3.7);
\draw (-1,0) node[above] {$-1$};
\draw (-4,0) node[above ] {$-4$};
\end{tikzpicture}
** 根轨迹示例2 $G_o(s) = \frac{K_g}{s(s+3)(s^2+2s+2)}$

解:

  * <2->开环零点: 无 , 开环极点: $0,-3,-1\pm j$
  * <3->实轴上根轨迹:  $[-3,0]$
  * <4->渐近线: 
       * $\sigma_a=\frac{\sum p_i-\sum z_j}{n-m}=-\frac{5}{3}$
       * $\phi=\pm\frac{\pi}{4},\pm\frac{3\pi}{4}$
  * <5->分离点: 
        \begin{eqnarray*}
        M'(s)N(s)-M(s)N'(s) &=& 0 \\
        4s^3+15s^2+16s+6 &= & 0 \\
        s &=& -2.3
        \end{eqnarray*}
  * <6->起始角: 
       * $\theta_{p_1}=180^{\circ}+(-135^{\circ}-90^{\circ}-\arctan\frac{1}{2})=-71.6^{\circ}$
       * $\theta_{p_2}=71.6^{\circ}$
** 根轨迹示例2(续) 
 * 与虚轴交点		

       $D(s)=s^4+5s^3+8s^2+6s+K_g =0$ 

***  Routh表如下						    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
  
                \[\begin{matrix}
                 s^4 & 1 & 8 & K_g \\
                 s^3 & 5 & 6 \\
                 s^2 & \frac{34}{5} & K_g \\
                 s^1 & \frac{204-25K_g}{34} \\
                 s^0 & K_g
                \end{matrix}\]

** 根轨迹示例2(续) 

***   计算交点处 $K_g$					      :BMCOL:B_block:
    :PROPERTIES:
    :BEAMER_col: 0.5
    :BEAMER_env: block
    :END:
		\begin{eqnarray*}
		\frac{204-25K_g}{34} &=& 0\\
		K_g &=& 8.16 \\
		\end{eqnarray*}
***    代入辅助方程:					      :BMCOL:B_block:
    :PROPERTIES:
    :BEAMER_col: 0.5
    :BEAMER_envargs: <2->
    :BEAMER_env: block
    :END:
		\begin{eqnarray*}
		\frac{34}{5}s^2+K_g & = & 0 \\
		s_{1,2} &=& \pm j 1.1
		\end{eqnarray*}

** 根轨迹示例2(续)根轨迹图
\begin{tikzpicture}
\coordinate (o) at (0,0);
\coordinate (ox) at (0.5,0);
\draw[->] (-3.5,0) -- (ox);
\draw[->] (0,-3) -- (0,3);
\draw (o) node[below left] {$o$};
\draw[thick,red] (-3,0) node {$\times$};
\draw[thick,red] (0,0) node {$\times$};
\draw[thick,red] (-1,1) node {$\times$};
\draw[thick,red] (-1,-1) node {$\times$};
\draw [red,thick,smooth] plot coordinates {(-1,-1) (-0.5,-0.9) (0,-1.1) (0.5,-1.7)};
\draw [red,thick,smooth] plot coordinates {(-1,1) (-0.5,0.9) (0,1.1) (0.5,1.7)};
\draw [red,thick,smooth] plot coordinates {(-2.35,0) (-2.45,0.7) (-3,1.6) (-3.5,2.2)};
\draw [red,thick,smooth] plot coordinates {(-2.35,0) (-2.45,-0.7) (-3,-1.6) (-3.5,-2.2)};
\draw [red,thick] (0,0)--(-3,0);
\draw [violet,dashed] (-1.25,0)--+(45:3);
\draw [violet,dashed] (-1.25,0)--+(135:3);
\draw [violet,dashed] (-1.25,0)--+(-45:3);
\draw [violet,dashed] (-1.25,0)--+(-135:3);
\draw (-1,0) node[above] {$-1$};
\draw (-3,0) node[above ] {$-3$};
\end{tikzpicture}
** 根轨迹示例3 $G_o(s) = \frac{K_g}{s^2(s+10)}$
*** 解:							      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_envargs: <2->
     :BEAMER_env: block
     :END:

  * 开环零点: 无 , 开环极点: $0,0,-10$
  * 实轴上根轨迹:  $[-\infty,-10]$
  * 渐近线: 
       * $\sigma_a=\frac{\sum p_i-\sum z_j}{n-m}=-\frac{10}{3}$
       * $\phi=\pm\frac{\pi}{3},\pi$

\begin{tikzpicture}[scale=0.55]
\coordinate (o) at (0,0);
\coordinate (ox) at (0.5,0);
\draw[->] (-5,0) -- (ox);
\draw[->] (0,-3) -- (0,3);
\draw (o) node[below left] {$o$};
\draw[thick,red] (-3,0) node {$\times$};
\draw[thick,red] (0,0) node {$\times$};
\draw [red,thick,smooth] plot coordinates {(0,0) (0.1,1.3) (0.3,2.1) (0.5,2.5)};
\draw [red,thick,smooth] plot coordinates {(0,0) (0.1,-1.3) (0.3,-2.1) (0.5,-2.5)};
\draw [->,red,thick] (-3,0)--(-5,0);
\draw [violet,dashed] (-1,0)--+(60:3);
\draw [violet,dashed] (-1,0)--+(-60:3);
\draw (-3,0) node[above ] {$-10$};
\end{tikzpicture}

***  当 $G_o=\frac{K_g(s+z)}{s^2(s+10)},0<z<10$		      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_envargs: <3->
     :BEAMER_env: block
     :END:

得: $\sigma_a=\frac{-10+z}{2},\phi=\pm\frac{\pi}{2}$

\begin{tikzpicture}
\coordinate (o) at (0,0);
\coordinate (ox) at (0.5,0);
\draw[->] (-3,0) -- (ox);
\draw[->] (0,-2) -- (0,2);
\draw (o) node[below left] {$o$};
\draw[thick,red] (-3,0) node {$\times$};
\draw[thick,red] (0,0) node {$\times$};
\draw[thick,red] (-2,0) node {$o$};
\draw [red,thick,smooth] plot coordinates {(0,0) (-0.2,0.5) (-0.8,1) (-1,2)};
\draw [red,thick,smooth] plot coordinates {(0,0) (-0.2,-0.5) (-0.8,-1) (-1,-2)};
\draw [->,red,thick] (-3,0)--(-2,0);
\draw [violet,dashed] (-1,-2)--(-1,2);
\draw (-3,0) node[above ] {$-10$};
\end{tikzpicture}


